Tekla Open API Reference for Tekla Structures 2025
PointCloud.AttachComplete Method
 Checks if the point cloud attach is complete. Needed when attaching non-Potree point cloud file, which needs conversion.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AttachComplete()
Public Function AttachComplete As Boolean
Return Value
Type: Boolean
True if successful, otherwise false.
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace